In [2]:
import pandas as pd

In [4]:
data1={ "Name": ["Braund, Mr. Owen Harris","Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
 "Age": [22, 35, 58],
 "Gender": ["male", "male", "female"]}

In [6]:
df=pd.DataFrame(data=data1)
df

                       Name  Age  Gender
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [20]:
df.Name #, df['Name'] -> same work

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [19]:
#series from scratch
a=pd.Series([1,2,3],index=['r1','r2','r3'] ,name='age')
a

r1    1
r2    2
r3    3
Name: age, dtype: int64

In [28]:
df.Age.max() # df['age'].max() -> same work

58

In [30]:
a.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: age, dtype: float64

In [32]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [69]:
#creating data frame from series
x=pd.Series([12,13,14], index=['a','b','c'], name ='Series1')
y=pd.Series([22,23,24], index=['a','b','c'], name ='Series2')


z=pd.DataFrame({'Series1' : x,'Series2' : y})
z.index=[0,1,2]   # resetting index
z
# isme dict ki keys iske column headers bnege and iski calues iske columns bnege

   Series1  Series2
0       12       22
1       13       23
2       14       24

In [52]:
z.shape

(3, 2)

In [55]:
rows ,columns =z.shape
print(rows)
print(columns)

3
2

In [70]:
z.index

Index([0, 1, 2], dtype='int64')

In [61]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [72]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [129]:
brics=pd.DataFrame({'Country':country,'Capital':capital,'Area':area,'Population':population})
brics

        Country    Capital    Area  Population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [75]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [78]:
brics.index=['a','b','c','d','e']
brics

        Country    Capital    Area  Population
a        Brazil   Brasilia   8.516       200.4
b        Russia     Moscow  17.100       143.5
c         India  New Delhi   3.286      1252.0
d         China    Beijing   9.670       133.0
e  South Africa   Pretoria   2.980         4.3

In [80]:
brics.index=range(1,10,2)
brics

        Country    Capital    Area  Population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [81]:
brics.columns

Index(['Country', 'Capital', 'Area', 'Population'], dtype='object')

In [83]:
brics.Country,#brics['Country']-> same

1          Brazil
3          Russia
5           India
7           China
9    South Africa
Name: Country, dtype: object

In [84]:
brics[['Country']]

        Country
1        Brazil
3        Russia
5         India
7         China
9  South Africa

In [86]:
brics.Country.dtype

dtype('O')

In [87]:
brics.Population.dtype

dtype('float64')

In [88]:
brics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 1 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     5 non-null      object
 1   Capital     5 non-null      object
 2   Area        5 non-null      float64
 3   Population  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [117]:
brics

        Country    Capital    Area  Population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [130]:
brics.set_index('Country',inplace=True)
brics

                Capital    Area  Population
Country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [132]:
brics.reset_index(inplace=True)# deal it with later
brics

   index       Country    Capital    Area  Population
0      0        Brazil   Brasilia   8.516       200.4
1      1        Russia     Moscow  17.100       143.5
2      2         India  New Delhi   3.286      1252.0
3      3         China    Beijing   9.670       133.0
4      4  South Africa   Pretoria   2.980         4.3

In [133]:
import pandas as pd

# Creating a sample DataFrame
brics = pd.DataFrame({
    'Country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
    'Population': [209288278, 144421022, 1393409038, 1397715000, 57779622],
    'Area': [8515767, 17098242, 3287263, 9596960, 1221037]
})

# Display the original DataFrame
print("Original DataFrame:")
print(brics)

# Rename the 'Population' column to 'Capital'
brics = brics.rename(columns={'Population': 'popu'})

# Display the DataFrame after renaming the column
print("\nDataFrame after renaming the 'Population' column to 'Capital':")
print(brics)

Original DataFrame:
        Country  Population      Area
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

DataFrame after renaming the 'Population' column to 'Capital':
        Country        popu      Area
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

In [135]:
brics.rename(columns={'popu':'Population'})

        Country  Population      Area
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

In [139]:
brics.columns=range(len(brics.columns))

In [140]:
brics

              0           1         2
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

In [149]:
type(brics.columns)

pandas.core.indexes.range.RangeIndex

In [148]:
brics.columns[1]

1

In [151]:
b=list(brics.columns)
b

[0, 1, 2]

In [152]:
b[1]='capital'

In [153]:
brics.columns =b

In [154]:
brics

              0     capital         2
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

In [155]:
b

[0, 'capital', 2]

In [181]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [182]:
brics= pd.DataFrame(data ={'country':country,'capital':capital,'area':area,'population':population})
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [183]:
b=brics.rename(columns={'country':'count','capital':'cap'})
b

          count        cap    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [196]:
b.reset_index()
b

   index         count        cap    area  population
0      0        Brazil   Brasilia   8.516       200.4
1      1        Russia     Moscow  17.100       143.5
2      2         India  New Delhi   3.286      1252.0
3      3         China    Beijing   9.670       133.0
4      4  South Africa   Pretoria   2.980         4.3

In [ ]:
b.drop

In [184]:
a=brics.rename(index={0:'row1',1:'row2'})
a

           country    capital    area  population
row1        Brazil   Brasilia   8.516       200.4
row2        Russia     Moscow  17.100       143.5
2            India  New Delhi   3.286      1252.0
3            China    Beijing   9.670       133.0
4     South Africa   Pretoria   2.980         4.3